---
kind: enumMember
id: F:Autodesk.Revit.DB.TextAlignFlags.TEF_ALIGN_LEFT
enum: Autodesk.Revit.DB.TextAlignFlags
source: html/ccbdb8fc-32c2-c781-184d-4d8ee8fe55db.htm
---
# Autodesk.Revit.DB.TextAlignFlags.TEF_ALIGN_LEFT

Align text left